import leftImg from "./../../img/aboutUs.png";
import engine from "./../../img/engine.png";
import "./AboutUs.css";

export default function AboutUs() {

    return (
        <div className="aboutUs__container">
            <div className="aboutUs__left-img">
                <img src={leftImg} alt="" />
            </div>
            <div className="aboutUs__text">
                <h2>Про нас</h2>
                <h5>
                    Ласкаво просимо до GearUp – вашого партнера у світі автосервісу та обслуговування автомобілів!<br /><br />
                    З 2020 року ми працюємо над тим, щоб забезпечити вас всеосяжною турботою про ваш автомобіль.
                    Наша ідея полягає в тому,
                    щоб зробити ваше життя легшим, об'єднуючи клієнтів та СТО. Тепер, при купівлі запчастин у нас,
                    ви можете встановити їх на ваш автомобіль безпосередньо в одному місці – швидко, зручно та ефективно.<br /><br />
                    Ми розуміємо, наскільки важливо для вас мати доступ до надійних та якісних послуг автосервісу,
                    тому ми завжди працюємо на межі можливостей, щоб забезпечити вам найкращі результати.
                    Наші спеціалісти володіють глибокими знаннями та навичками, що дозволяють їм ефективно вирішувати
                    будь-які проблеми з вашим автомобілем. У нас ви знайдете не лише якісне обслуговування, але й дружній
                    та професійний підхід до кожного клієнта. Разом з GearUp ваш автомобіль завжди буде в надійних руках,
                    а ваші поїздки - приємними та безпечними.<br /><br />
                    Наша команда відзначається індивідуальним підходом до кожного клієнта, розуміючи унікальні потреби
                    кожного власника автомобіля. Ми постійно вдосконалюємо наші процеси та впроваджуємо нові технології,
                    щоб забезпечити вам найкращі рішення для вашого транспортного засобу. Ваше задоволення від нашої
                    роботи є нашою головною метою,
                    і ми прагнемо досягти цього кожного разу, надаючи вам надійність та якість у кожній деталі
                    обслуговування.<br /><br />
                    Ми пишаємося нашою здатністю надавати повний спектр послуг, починаючи від регулярного
                    технічного обслуговування і закінчуючи складними ремонтними роботами. Наша мета - не лише
                    вирішувати проблеми вашого автомобіля, а й забезпечувати вам впевненість і спокій на дорозі.
                    Ми завжди стежимо за новітніми тенденціями в автомобільній промисловості та впроваджуємо їх
                    у наші послуги, щоб забезпечити вам максимальний рівень задоволення і комфорту.
                    Залишайте свій автомобіль на обслуговування в GearUp і переконайтеся в якості наших послуг особисто!<br /><br />
                    У GearUp ми пропонуємо вам товари за справедливими цінами, а також надаємо гарантію на всі
                    наші товари та послуги. Ваша зручність та безпека - наш пріоритет.
                    Довірте свій автомобіль GearUP – ми завжди готові допомогти вам на шляху до безпечних
                    та комфортних поїздок!

                </h5>
                <div className="aboutUs__text-bottom">
                    <div className="aboutUs__text-bottom-item">
                        <h1>20 тис</h1>
                        <h4>Обслуговуваних авто</h4>
                    </div>
                    <div className="aboutUs__text-bottom-item">
                        <h1>90%</h1>
                        <h4>Задоволених клієнтів</h4>
                    </div>
                    <div className="aboutUs__text-bottom-item">
                        <h1>4</h1>
                        <h4>Роки на ринку</h4>
                    </div>
                </div>
            </div>
            <div className="aboutUs__right-img">
                <img src={engine} alt="" />
            </div>
        </div>
    );
}